spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_associated_with_the_amount.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_104CVS4tb5cZffxRRFgxS6Ve
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.13.0
      Authorization:
      - Bearer sk_test_OwLn2xDcWLy5giDqk5b9Fq1k
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.13.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        myflix-104012 3.13.4 #1 SMP Mon Mar 3 09:07:22 UTC 2014 x86_64 x86_64 x86_64
        GNU/Linux"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 11 Jun 2014 09:19:03 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1468'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-05-19'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_104CVS4tb5cZffxRRFgxS6Ve",
          "created": 1402472781,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_104CVS4tb5cZffxRN42z2Jrw",
              "object": "charge",
              "created": 1402472781,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "gbp",
              "refunded": false,
              "card": {
                "id": "card_104CVS4tb5cZffxRKbkvw2ND",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 6,
                "exp_year": 2016,
                "fingerprint": "VfkQZgiLeMQDObnc",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4CVSp9GltJYJCq"
              },
              "captured": true,
              "refunds": [],
              "balance_transaction": "txn_104CVS4tb5cZffxRrMEy5Txg",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_4CVSp9GltJYJCq",
              "invoice": "in_104CVS4tb5cZffxRScQjHfNV",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": "MyFlix monthly"
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_4CVSUHW1kZ5ONx"
        }
    http_version: 
  recorded_at: Wed, 11 Jun 2014 09:19:04 GMT
recorded_with: VCR 2.9.2
